<?php 


$db_host = "localhost";
$db_user = "root";
$db_pass = "1234";
$db_name = "mydatabase";

$conn= mysqli_connect("localhost","root","1234","mydatabase") or die("Error: " . mysqli_error($conn));
$conn = new mysqli($db_host, $db_user, $db_pass, $db_name);

if ($conn->connect_errno) {
    echo "Fail to connect MySQL:(" . $conn->connect_errno . ")" . $conn->connect_error;
}


date_default_timezone_set('Asia/Bangkok');

$Userlevelname = array("None",
   "แอดมิน",  /*1*/
   "ลูกจ้าง",  /*2*/
   "พนักงาน",/*3*/
 "ยกเลิกใช้งาน",/*4*/
 "หัวหน้าส่วนงาน",/*5*/
"ผู้อำนวยการสำนัก",/*6*/); 


$Officename = array("-", 
   "สำนักตรวจสอบภายใน" , /*1+*/
   "สำนักอำนวยการ", /*2+*/
   "สำนักทรัพยากรมนุษย์", /*3+*/
   "สำนักบัญชีและการเงิน", /*4+*/
   "สำนักยุทธศาสตร์และงบประมาณ",/*5+*/
   "สำนักเทคโนโลยีดิจิทัล", /*6**/
   "สำนักนิติการ", /*7+*/
   "สำนักคดี", /*8+*/
   "สำนักพัฒนาธุรกิจ", /*9+*/
   "สำนักโลจิสติกส์", /*10+*/
   "สำนักข้าว", /*11+*/
   "สำนักเกษตร",/*12+*/
   "สำนักสัตว์น้ำและบริหารคลัง");/*13*/

$Partworkname =array("-",
    "ส่วนงานตรวจสอบ1",
    "ส่วนงานตรวจสอบ2",
    "ส่วนงานสารบรรณ",
    "ส่วนงานเลขานุการ",
    "ส่วนงานงานประชุม",
    "ส่วนงานประชาสัมพันธ์", 
    "ส่วนงานบริหารบุคคล",
    "ส่วนงานประเมินผลและพัฒนาบุคคล",
    "ส่วนงานเงินเดือนและสวัสดิการ",
/*10*/"ส่วนงานรายได้และลูกหนี้",
    "ส่วนงานการเงิน",
    "ส่วนงานบัญชีและรายงาน",
    "ส่วนงานบัญชีสินค้าและต้นทุน",
    "ส่วนงานวางแผยยุทธศาสตร์",
    "ส่วนงานงบประมาณ",
    "ส่วนงานบริหารความเสี่ยงและควบคุมภายใน",
    "ส่วนงานพัสดุ",
    "ส่วนงานพัฒนาเทคโนโลยี",
    "ส่วนงานบริหารเครือข่ายและฐานข้อมูล",
/*20*/"ส่วนงานที่ปรึกษากฎหมาย" ,
    "ส่วนงานบริหารสัญญา" ,
    "ส่วนงานวินัย" ,
    "ส่วนงานคดีแพ่งและปกครอง1" ,
    "ส่วนงานคดีแพ่งและปกครอง2",
    "ส่วนงานคดีอาญา",
    "ส่วนงานบังคับคดี",
    "ส่วนงานการตลาดออนไลน์และออฟไลน์" ,
    "ส่วนงานพัฒนาผลิตภัณฑ์" ,
    "ส่วนงานผู้ประกอบการจำหน่ายอาหาร" ,
/*30*/"ส่วนงานร้านค้า", 
    "ส่วนงานบริหารการขนส่ง",
    "ส่วนงานปศุสัตว์",
    "ส่วนงานภาครัฐและเอกชน",
    "ส่วนงานข้าวหอม",
    "ส่วนงานข้าวสาร",
    "ส่วนงานข้าวชนิดพิเศษ",
    "ส่วนงานโครงการรัฐ",
    "ส่วนงานเกษตร1",
    "ส่วนงานเกษตร2",
/*40*/"ส่วนงานเกษตร3",
    "ส่วนงานคลัง1 และสินค้าภูมิภาค",
    "ส่วนงานคลัง2",
    "ส่วนงานสัตว์น้ำ");

$Workname = array("-",             /*0*/
            "-",                   /*1*/
   "งานประเมินผลและพัฒนาบุคคล" ,               /*2+*/
   "งานศูนย์บริการการต่อต้านทุจริตและบริการประชาชน",  /*3*/
   "งานสืบสวนสอบสวน", /*4*/
   "งานสัญญาซื้อขาย",  /*5+*/
   "งานปิดบัญชีโครงการ",/*6+*/
   "งานปิดบัญชี",      /*7*/
   "งานค่าใช้จ่าย",     /*8*/
   "งานคดีและอื่นๆ");   /*9*/
 ?>

<!------->
